"""
Задача №2:
Напишите программу, которая принимает на вход координаты
двух точек и находит расстояние между ними в 2D пространстве.
A (3,6); B (2,1) -> 5,09
A (7,-5); B (1,-1) -> 7,21
"""
import cmath
Ax = int(input('Введите координату х точки А: '))
Ay = int(input('Введите координату y точки А: '))
Bx = int(input('Введите координату х точки B: '))
By = int(input('Введите координату y точки B: '))

numA = [Ax, Ay]
numB = [Bx, By]

Lenght = ((Bx - Ax)**2 + (By - Ay)**2) ** (0.5)
sqrt = cmath.sqrt(Lenght)

print(numA,';', numB, '->', (round(Lenght, 3)))
